tangyangguang/Esp32Base/src/web/internal/WebFs.cpp
#include "../../Esp32BaseProfile.h"

#if ESP32BASE_ENABLE_WEB && ESP32BASE_ENABLE_FS

#include "WebInternal.h"

namespace esp32base_web {

static const uint8_t FS_TOP_MAX = 10;
static const uint16_t FS_TREE_LIST_LIMIT = 128;
static const uint16_t FS_UPLOAD_DIR_LIMIT = 64;
static const uint8_t FS_SCAN_MAX_DEPTH = 8;
static const uint32_t FS_TRUSTED_TIME_MIN_EPOCH = ESP32BASE_TIME_SYNC_MIN_EPOCH;

void fsScanYield() {
#if ESP32BASE_ENABLE_WATCHDOG
    Esp32BaseWatchdog::feed();
#endif
    yield();
}

void fsFormatCount(uint32_t count, char* out, size_t len) {
    snprintf(out, len, "%lu", static_cast<unsigned long>(count));
}

bool fsJoinPath(const char* dir, const char* name, char* out, size_t len) {
    if (!out || len == 0) {
        return false;
    }
    int written = 0;
    if (!name || !name[0]) {
        written = snprintf(out, len, "%s", dir && dir[0] ? dir : "/");
    } else if (name[0] == '/') {
        written = snprintf(out, len, "%s", name);
    } else if (!dir || !dir[0] || strcmp(dir, "/") == 0) {
        written = snprintf(out, len, "/%s", name);
    } else {
        written = snprintf(out, len, "%s/%s", dir, name);
    }
    if (written <= 0 || static_cast<size_t>(written) >= len) {
        out[0] = '\0';
        return false;
    }
    return true;
}

void fsAddTopFile(FsScan& scan, const char* path, uint64_t size) {
    uint8_t pos = scan.topCount;
    while (pos > 0 && size > scan.top[pos - 1].size) {
        --pos;
    }
    if (pos >= FS_TOP_MAX) {
        return;
    }
    const uint8_t limit = scan.topCount < FS_TOP_MAX ? scan.topCount : static_cast<uint8_t>(FS_TOP_MAX - 1);
    for (int8_t i = static_cast<int8_t>(limit); i > static_cast<int8_t>(pos); --i) {
        scan.top[i] = scan.top[i - 1];
    }
    if (scan.topCount < FS_TOP_MAX) {
        ++scan.topCount;
    }
    scan.top[pos].size = size;
    strlcpy(scan.top[pos].path, path && path[0] ? path : "-", sizeof(scan.top[pos].path));
}

void sendFsDeleteForm(const char* path) {
    sendChunk("<form method='post' action='/esp32base/fs/delete' onsubmit=\"return confirm('Delete this file? This cannot be undone.')&&once(this)\">");
    sendHiddenInput("path", path && path[0] ? path : "");
    sendChunk("<input class='danger fsdelete' type='submit' value='Delete'></form>");
}

void sendFsDownloadForm(const char* path) {
    sendChunk("<form method='get' action='/esp32base/fs/download'>");
    sendHiddenInput("path", path && path[0] ? path : "");
    sendChunk("<input class='secondary fsaction' type='submit' value='Download'></form>");
}

void sendFsPathTooLongRow(const char* dir, const char* name, bool isDir) {
    sendChunk("<tr><td>");
    sendEscapedHtmlChunk(dir && dir[0] ? dir : "/");
    sendChunk("/");
    sendEscapedHtmlChunk(name && name[0] ? name : "-");
    sendChunk("</td><td>");
    sendEscapedHtmlChunk(isDir ? "dir" : "file");
    sendChunk("</td><td>-</td><td>-</td><td>");
    sendStatusTag(Esp32BaseWeb::UI_WARN, "path too long");
    sendChunk("</td><td>-</td></tr>");
}

#if ESP32BASE_ENABLE_APP_EVENTS
bool appEventsOwnsPath(const char* path) {
    return path && strcmp(path, Esp32BaseAppEvents::eventStorePath()) == 0;
}

void sendFsAppEventsTag() {
    sendStatusTag(Esp32BaseWeb::UI_INFO, "app events store");
}
#endif

bool recordStoreOwnsPath(const char* path) {
    static const char prefix[] = "/esp32base/records/";
    return path && strncmp(path, prefix, sizeof(prefix) - 1U) == 0;
}

bool esp32BaseOwnsPath(const char* path) {
    return path && (strcmp(path, "/esp32base") == 0 || strncmp(path, "/esp32base/", 11) == 0);
}

void sendFsEsp32BaseTag() {
    sendStatusTag(Esp32BaseWeb::UI_INFO, "esp32base managed");
}

void fsFormatModifiedTime(uint32_t modifiedEpoch, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    if (modifiedEpoch < FS_TRUSTED_TIME_MIN_EPOCH) {
        strlcpy(out, "unknown", len);
        return;
    }
#if ESP32BASE_ENABLE_TIME
    if (!Esp32BaseTime::formatEpoch(modifiedEpoch, out, len, "%Y-%m-%d %H:%M:%S")) {
        strlcpy(out, "unknown", len);
    }
#else
    strlcpy(out, "unknown", len);
#endif
}

void sendFsFileStatus(const char* path, bool readable) {
#if ESP32BASE_ENABLE_APP_EVENTS
    if (appEventsOwnsPath(path)) {
        sendFsAppEventsTag();
    } else
#endif
#if ESP32BASE_ENABLE_FILELOG
    if (fileLogOwnsPath(path)) {
        sendStatusTag(Esp32BaseWeb::UI_INFO, "filelog");
    } else
#endif
    if (esp32BaseOwnsPath(path)) {
        sendFsEsp32BaseTag();
    } else if (readable) {
        sendStatusTag(Esp32BaseWeb::UI_OK, "ok");
    }
    if (!readable) {
        sendStatusTag(Esp32BaseWeb::UI_WARN, "unreadable");
    }
}

void sendFsDirStatus(const char* path) {
    if (esp32BaseOwnsPath(path)) {
        sendFsEsp32BaseTag();
    } else {
        sendStatusTag(Esp32BaseWeb::UI_OK, "ok");
    }
}

void sendFsFileActions(const char* path, bool manage) {
    sendChunk("<div class='fsactions'>");
    sendFsDownloadForm(path);
    if (manage && !recordStoreOwnsPath(path)) {
        sendFsDeleteForm(path);
    }
    sendChunk("</div>");
}

void sendFsUnreadableActions(const char* path, bool manage) {
    sendChunk("<div class='fsactions'>");
    if (manage && !recordStoreOwnsPath(path)) {
        sendFsDeleteForm(path);
    } else {
        sendChunk("-");
    }
    sendChunk("</div>");
}

bool fsFileReadableStart(const char* path, size_t size) {
    if (size == 0) {
        return true;
    }
    uint8_t value = 0;
    size_t readLen = 0;
    return Esp32BaseFs::readBytesAt(path, 0, &value, 1, &readLen) && readLen == 1;
}

bool fsFileFullyReadable(const char* path, uint32_t size) {
    if (size == 0) {
        return true;
    }
    uint8_t buffer[512];
    uint32_t offset = 0;
    while (offset < size) {
        const size_t maxLen = size - offset > sizeof(buffer) ? sizeof(buffer) : static_cast<size_t>(size - offset);
        size_t readLen = 0;
        if (!Esp32BaseFs::readBytesAt(path, offset, buffer, maxLen, &readLen) || readLen == 0) {
            return false;
        }
        offset += static_cast<uint32_t>(readLen);
        fsScanYield();
    }
    return offset == size;
}

void sendFsTreeRow(const char* path, size_t size, bool isDir, uint32_t modifiedEpoch, bool manage) {
    char sizeBuf[48];
    char modified[32];
    fsFormatModifiedTime(modifiedEpoch, modified, sizeof(modified));
    sendChunk("<tr><td>");
    sendEscapedHtmlChunk(path && path[0] ? path : "-");
    sendChunk("</td><td>");
    sendEscapedHtmlChunk(isDir ? "dir" : "file");
    sendChunk("</td><td>");
    if (isDir) {
        sendChunk("-");
    } else {
        formatReadableBytes(size, sizeBuf, sizeof(sizeBuf));
        sendEscapedHtmlChunk(sizeBuf);
    }
    sendChunk("</td><td>");
    sendEscapedHtmlChunk(modified);
    sendChunk("</td><td>");
    const bool readable = isDir || fsFileReadableStart(path, size);
    if (isDir) {
        sendFsDirStatus(path);
    } else {
        sendFsFileStatus(path, readable);
    }
    sendChunk("</td><td>");
    if (isDir) {
        sendChunk("-");
    } else if (!readable) {
        sendFsUnreadableActions(path, manage);
    } else {
        sendFsFileActions(path, manage);
    }
    sendChunk("</td></tr>");
}

void fsWalkCallback(const Esp32BaseFs::EntryInfo& entry, void* user);
void fsNoopListCallback(const char*, size_t, bool, void*);

bool fsWalkDir(FsScan& scan, const char* dir, uint8_t depth, bool emitRows, bool manage, uint16_t emitLimit, uint16_t* emittedRows) {
    FsWalkFrame frame = {&scan, dir, depth, emitRows, manage, emitLimit, emittedRows};
    return Esp32BaseFs::listDirInfo(dir, fsWalkCallback, &frame);
}

void fsWalkCallback(const Esp32BaseFs::EntryInfo& entry, void* user) {
    FsWalkFrame* frame = static_cast<FsWalkFrame*>(user);
    if (!frame || !frame->scan) {
        return;
    }
    char path[96];
    const bool pathOk = fsJoinPath(frame->dir, entry.name, path, sizeof(path));
    frame->scan->entries++;
    if (!pathOk) {
        if (entry.isDir) {
            frame->scan->dirs++;
        } else {
            frame->scan->files++;
            frame->scan->listedSize += entry.size;
        }
        if (frame->emitRows && frame->emittedRows && *frame->emittedRows < frame->emitLimit) {
            sendFsPathTooLongRow(frame->dir, entry.name, entry.isDir);
            (*frame->emittedRows)++;
        }
        fsScanYield();
        return;
    }
    if (entry.isDir) {
        frame->scan->dirs++;
    } else {
        frame->scan->files++;
        frame->scan->listedSize += entry.size;
        fsAddTopFile(*frame->scan, path, entry.size);
    }
    if (frame->emitRows && frame->emittedRows && *frame->emittedRows < frame->emitLimit) {
        sendFsTreeRow(path, entry.size, entry.isDir, entry.modifiedEpoch, frame->manage);
        (*frame->emittedRows)++;
    }
    fsScanYield();
    if (entry.isDir && frame->depth + 1 < FS_SCAN_MAX_DEPTH && (!frame->emitRows || !frame->emittedRows || *frame->emittedRows < frame->emitLimit)) {
        fsWalkDir(*frame->scan, path, static_cast<uint8_t>(frame->depth + 1), frame->emitRows, frame->manage, frame->emitLimit, frame->emittedRows);
    }
}

