tangyangguang/Esp32Base/src/web/internal/WebFs.cpp
void fsSendUploadJson(int code, bool ok, const char* error, const char* path, bool exists = false, bool isDir = false) {
    if (!beginResponse(code, "application/json", nullptr)) {
        return;
    }
    sendChunk("{\"ok\":");
    sendChunk(ok ? "true" : "false");
    fsSendJsonBool("exists", exists);
    fsSendJsonBool("directory", isDir);
    if (path && path[0]) {
        sendChunk(",\"path\":\"");
        sendEscapedJsonChunk(path);
        sendChunk("\"");
    }
    if (error && error[0]) {
        sendChunk(",\"error\":\"");
        sendEscapedJsonChunk(error);
        sendChunk("\"");
    }
    sendChunk("}");
    endResponse();
}

void fsUploadDirOptionCallback(const char* name, size_t, bool isDir, void* user);

void sendFsUploadDirectoryOptionsFor(const char* dir, uint8_t depth, uint16_t* emitted, bool* pathTooLong) {
    if (!emitted || *emitted >= FS_UPLOAD_DIR_LIMIT || depth >= FS_SCAN_MAX_DEPTH) {
        return;
    }
    FsUploadDirFrame frame = {dir, depth, emitted, pathTooLong};
    Esp32BaseFs::listDir(dir, fsUploadDirOptionCallback, &frame);
}

void fsUploadDirOptionCallback(const char* name, size_t, bool isDir, void* user) {
    if (!isDir || !user) {
        return;
    }
    FsUploadDirFrame* frame = static_cast<FsUploadDirFrame*>(user);
    if (!frame->emitted || *frame->emitted >= FS_UPLOAD_DIR_LIMIT) {
        return;
    }
    char path[96];
    if (!fsJoinPath(frame->dir, name, path, sizeof(path))) {
        if (frame->pathTooLong) {
            *frame->pathTooLong = true;
        }
        sendChunk("<option disabled>path too long: ");
        sendEscapedHtmlChunk(frame->dir && frame->dir[0] ? frame->dir : "/");
        sendChunk("/");
        sendEscapedHtmlChunk(name && name[0] ? name : "-");
        sendChunk("</option>");
        (*frame->emitted)++;
        fsScanYield();
        return;
    }
    if (!validFsDirectoryPath(path)) {
        return;
    }
    sendChunk("<option value='");
    sendEscapedHtmlChunk(path);
    sendChunk("'>");
    sendEscapedHtmlChunk(path);
    sendChunk("</option>");
    (*frame->emitted)++;
    fsScanYield();
    sendFsUploadDirectoryOptionsFor(path, static_cast<uint8_t>(frame->depth + 1), frame->emitted, frame->pathTooLong);
}

void sendFsUploadPanel() {
    sendChunk("<section class='panel formpanel uploadpanel'><h2>Upload file</h2><form id='fsu' class='editform'><div class='fieldgrid'><div class='field short'><label for='fsudir'>Device directory</label><select id='fsudir' name='dir'><option value='/'>/</option>");
    uint16_t emitted = 1;
    bool pathTooLong = false;
    sendFsUploadDirectoryOptionsFor("/", 0, &emitted, &pathTooLong);
    sendChunk("</select></div><div class='field full'><label for='fsufile'>File</label><input id='fsufile' type='file' name='file' required></div><div class='field full'><small>Uses local filename; directory must exist.");
    if (pathTooLong) {
        sendChunk(" Some directories are hidden because their paths are too long.");
    }
    sendChunk("</small></div></div><div class='actions'><input type='submit' value='Upload'></div></form><progress id='fsup' value='0' max='100' style='width:100%;display:none'></progress><p id='fsus' class='statusline muted'></p></section>");
    sendProgmem(WEB_UPLOAD_HELPERS);
    sendChunk("<script>function fsUEnc(s){return encodeURIComponent(s);}function fsUFail(t){var f=document.getElementById('fsu'),b=f.querySelector('[type=submit]');document.getElementById('fsus').textContent=t;f.dataset.busy='';if(b)b.disabled=false;}function fsUSend(dir,file,ow){var f=document.getElementById('fsu'),st=document.getElementById('fsus'),pg=document.getElementById('fsup'),b=f.querySelector('[type=submit]'),d=new FormData(),x=new XMLHttpRequest();d.append('file',file,file.name);if(b)b.disabled=true;pg.style.display='block';st.textContent='Uploading 0%';x.upload.onprogress=function(ev){if(ev.lengthComputable){var p=Math.floor(ev.loaded*100/ev.total);pg.value=p;st.textContent='Uploading '+p+'% '+ebFmtBytes(ev.loaded)+' / '+ebFmtBytes(ev.total);}};x.onload=function(){var r={};try{r=JSON.parse(x.responseText||'{}');}catch(e){}if(x.status==200&&r.ok){location.href=r.redirect||'/esp32base/fs?manage=1&uploaded=1';return;}fsUFail('Upload failed: '+(r.error||('HTTP '+x.status)));};x.onerror=function(){fsUFail('Upload failed: network error');};x.open('POST','/esp32base/fs/upload?dir='+fsUEnc(dir)+(ow?'&overwrite=1':''));x.send(d);}document.getElementById('fsu').onsubmit=function(e){e.preventDefault();if(this.dataset.busy)return false;this.dataset.busy=1;var dir=document.getElementById('fsudir').value,file=document.getElementById('fsufile').files[0],st=document.getElementById('fsus'),b=this.querySelector('[type=submit]');if(!file){this.dataset.busy='';return false;}if(b)b.disabled=true;st.textContent='Checking target...';var x=new XMLHttpRequest();x.onload=function(){var r={};try{r=JSON.parse(x.responseText||'{}');}catch(e){}if(x.status!=200||!r.ok){fsUFail('Upload blocked: '+(r.error||('HTTP '+x.status)));return;}var ow=false;if(r.exists){ow=confirm((r.path||file.name)+' already exists. Overwrite?');if(!ow){fsUFail('Upload canceled');return;}}fsUSend(dir,file,ow);};x.onerror=function(){fsUFail('Upload blocked: network error');};x.open('GET','/esp32base/fs/check?dir='+fsUEnc(dir)+'&name='+fsUEnc(file.name));x.send();return false;};</script>");
}

void fsDownloadFilename(const char* path, char* out, size_t len) {
    if (!out || len == 0) {
        return;
    }
    const char* name = path ? strrchr(path, '/') : nullptr;
    name = name && name[1] ? name + 1 : "littlefs.bin";
    size_t used = 0;
    for (const char* p = name; *p && used + 1 < len && used < 63; ++p) {
        const char c = *p;
        const bool ok = (c >= 'a' && c <= 'z') || (c >= 'A' && c <= 'Z') ||
                        (c >= '0' && c <= '9') || c == '.' || c == '_' || c == '-';
        out[used++] = ok ? c : '_';
    }
    out[used] = '\0';
    if (!validDownloadFilename(out)) {
        strlcpy(out, "littlefs.bin", len);
    }
}

void fsNoopListCallback(const char*, size_t, bool, void*) {
}

#if ESP32BASE_ENABLE_FILELOG
bool fileLogOwnsPath(const char* path) {
    if (!path || !path[0]) {
        return false;
    }
    if (strcmp(path, Esp32BaseFileLog::path()) == 0) {
        return true;
    }
    char segment[Esp32BaseFileLog::SEGMENT_PATH_BUFFER_SIZE];
    for (uint8_t i = 0; i < Esp32BaseFileLog::rotateFiles(); ++i) {
        if (Esp32BaseFileLog::segmentPath(i, segment, sizeof(segment)) && strcmp(path, segment) == 0) {
            return true;
        }
    }
    return false;
}
#endif

void sendFsInventoryValue(const FsScan& scan, uint64_t fsUsed) {
    char files[16];
    char dirs[16];
    char listed[48];
    char other[48];
    fsFormatCount(scan.files, files, sizeof(files));
    fsFormatCount(scan.dirs, dirs, sizeof(dirs));
    formatReadableBytes(scan.listedSize, listed, sizeof(listed));
    const uint64_t overheadBytes = fsUsed > scan.listedSize ? fsUsed - scan.listedSize : 0;
    formatReadableBytes(overheadBytes, other, sizeof(other));
    sendSubmetricsStart();
    sendSubmetric("Files", files);
    sendSubmetric("Dirs", dirs);
    sendSubmetric("Listed size", listed);
    sendSubmetric("Other/overhead", other);
    sendSubmetricsEnd();
}

void sendFsSummaryCell(const char* label, const char* value) {
    sendChunk("<td><b>");
    sendEscapedHtmlChunk(label);
    sendChunk("</b><em>");
    sendEscapedHtmlChunk(value);
    sendChunk("</em></td>");
}

void sendFsSummaryTable(const FsScan& scan) {
    char used[48];
    char total[48];
    char freeBytes[48];
    char files[16];
    char dirs[16];
    char listed[48];
    char other[48];
    size_t fsTotal = 0;
    size_t fsUsed = 0;
    const bool infoOk = Esp32BaseFs::storageInfo(fsTotal, fsUsed);
    const size_t fsFree = infoOk && fsTotal > fsUsed ? fsTotal - fsUsed : 0;
    formatReadableBytes(fsUsed, used, sizeof(used));
    formatReadableBytes(fsTotal, total, sizeof(total));
    formatReadableBytes(fsFree, freeBytes, sizeof(freeBytes));
    fsFormatCount(scan.files, files, sizeof(files));
    fsFormatCount(scan.dirs, dirs, sizeof(dirs));
    formatReadableBytes(scan.listedSize, listed, sizeof(listed));
    const uint64_t overheadBytes = fsUsed > scan.listedSize ? fsUsed - scan.listedSize : 0;
    formatReadableBytes(overheadBytes, other, sizeof(other));

    sendChunk("<table class='fsummary'><tr><th>FS</th><td>");
    sendStatusTag(!infoOk || fsFree == 0 ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK,
                  !infoOk ? "info failed" : (fsFree == 0 ? "full" : "ready"));
    sendChunk("</td>");
    sendFsSummaryCell("Used", used);
    sendFsSummaryCell("Free", freeBytes);
    sendFsSummaryCell("Total", total);
    sendChunk("</tr><tr><th>File inventory</th>");
    sendFsSummaryCell("Files", files);
    sendFsSummaryCell("Dirs", dirs);
    sendFsSummaryCell("Listed size", listed);
    sendFsSummaryCell("Other/overhead", other);
    sendChunk("</tr></table>");
}

void sendFsSummaryRows(const FsScan& scan) {
    char used[48];
    char total[48];
    char freeBytes[48];
    size_t fsTotal = 0;
    size_t fsUsed = 0;
    const bool infoOk = Esp32BaseFs::storageInfo(fsTotal, fsUsed);
    const size_t fsFree = infoOk && fsTotal > fsUsed ? fsTotal - fsUsed : 0;
    formatReadableBytes(fsUsed, used, sizeof(used));
    formatReadableBytes(fsTotal, total, sizeof(total));
    formatReadableBytes(fsFree, freeBytes, sizeof(freeBytes));
    sendInfoRowStart("FS");
    sendStatusTag(!infoOk || fsFree == 0 ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK,
                  !infoOk ? "info failed" : (fsFree == 0 ? "full" : "ready"));
    sendChunk("<a class='btnlink compact' href='/esp32base/fs'>Details</a>");
    sendSubmetricsStart();
    sendSubmetric("Used", used);
    sendSubmetric("Free", freeBytes);
    sendSubmetric("Total", total);
    sendSubmetricsEnd();
    sendInfoRowEnd();
    sendInfoRowStart("File inventory");
    sendFsInventoryValue(scan, fsUsed);
    sendInfoRowEnd();
}

void sendFsQuickSummaryRows() {
    char used[48];
    char total[48];
    char freeBytes[48];
    size_t fsTotal = 0;
    size_t fsUsed = 0;
    const bool infoOk = Esp32BaseFs::storageInfo(fsTotal, fsUsed);
    const size_t fsFree = infoOk && fsTotal > fsUsed ? fsTotal - fsUsed : 0;
    formatReadableBytes(fsUsed, used, sizeof(used));
    formatReadableBytes(fsTotal, total, sizeof(total));
    formatReadableBytes(fsFree, freeBytes, sizeof(freeBytes));
    sendInfoRowStart("FS");
    sendStatusTag(!infoOk || fsFree == 0 ? Esp32BaseWeb::UI_WARN : Esp32BaseWeb::UI_OK,
                  !infoOk ? "info failed" : (fsFree == 0 ? "full" : "ready"));
    sendChunk("<a class='btnlink compact' href='/esp32base/fs'>Details</a>");
    sendSubmetricsStart();
    sendSubmetric("Used", used);
    sendSubmetric("Free", freeBytes);
    sendSubmetric("Total", total);
    sendSubmetricsEnd();
    sendInfoRowEnd();
    sendInfoRowStart("File inventory");
    sendChunk("<span class='info'>Open FS details for file count, directory count and top files.</span>");
    sendInfoRowEnd();
}

void handleFsPage() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    const bool manage = fsManageMode();
    Esp32BaseWeb::sendHeader("File system");
    Esp32BaseWeb::sendPageTitle("File system", "Read-only LittleFS inventory and storage usage.");
    if (g_server.hasArg("uploaded")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "File uploaded");
    } else if (g_server.hasArg("deleted")) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_OK, "File deleted or cleared");
    } else if (g_server.hasArg("error")) {
        const String error = g_server.arg("error");
        const char* message = error == "delete_failed" ?
            "LittleFS could not remove or clear the file. For FileLog files, use Clear system logs or format LittleFS if storage remains full." :
            error.c_str();
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_DANGER, "File action failed", message);
    }
    if (!Esp32BaseFs::isReady()) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "LittleFS unavailable");
        Esp32BaseWeb::sendFooter();
        return;
    }
    FsScan scan;
    if (!scanFs(scan)) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "LittleFS scan failed");
        Esp32BaseWeb::sendFooter();
        return;
    }
    if (fsInternalUsageHigh(scan)) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "Internal FS usage is high", "Visible files are much smaller than FS used. Delete may not fully recover space; download files you need and format LittleFS if free space stays low.");
    }
    if (manage) {
        Esp32BaseWeb::sendNotice(Esp32BaseWeb::UI_WARN, "File management mode", "Only single-file delete is available. Directories, batch actions and edit are intentionally not provided.");
        sendChunk("<p class='statusline'><a class='btnlink secondary' href='/esp32base/fs'>View only</a></p>");
        sendFsUploadPanel();
    } else {
        sendChunk("<p class='statusline'><a class='btnlink warn' href='/esp32base/fs?manage=1'>Manage files</a></p>");
    }
    sendChunk("<section class='panel statuspage'><h2>Summary</h2><div class='tablewrap'>");
    sendFsSummaryTable(scan);
    sendChunk("</div></section>");

    sendChunk("<section class='panel statuspage'><h2>Largest files</h2><div class='tablewrap'><table class='part'><tr><th>Path</th><th>Size</th></tr>");
    if (scan.topCount == 0) {
        sendChunk("<tr><td colspan='2'>No files</td></tr>");
    } else {
        char sizeBuf[48];
        const uint8_t count = scan.topCount < FS_TOP_MAX ? scan.topCount : FS_TOP_MAX;
        for (uint8_t i = 0; i < count; ++i) {
            formatReadableBytes(scan.top[i].size, sizeBuf, sizeof(sizeBuf));
            sendChunk("<tr><td>");
            sendEscapedHtmlChunk(scan.top[i].path);
            sendChunk("</td><td>");
            sendEscapedHtmlChunk(sizeBuf);
            sendChunk("</td></tr>");
        }
    }
    sendChunk("</table></div></section>");

