tangyangguang/Esp32Base/src/web/internal/WebFs.cpp
    sendChunk("<section class='panel statuspage'><h2>File tree</h2><div class='tablewrap'><table class='part'><tr><th>Path</th><th>Type</th><th>Size</th><th>Last modified</th><th>Status</th><th>Action</th></tr>");
    FsScan treeScan;
    memset(&treeScan, 0, sizeof(treeScan));
    uint16_t emittedRows = 0;
    fsWalkDir(treeScan, "/", 0, true, manage, FS_TREE_LIST_LIMIT, &emittedRows);
    if (emittedRows == 0) {
        sendChunk("<tr><td colspan='6'>No files</td></tr>");
    }
    sendChunk("</table></div>");
    if (scan.entries > FS_TREE_LIST_LIMIT) {
        sendChunk("<p class='notice warn'>File tree truncated at 128 entries.</p>");
    }
    sendChunk("</section>");
    Esp32BaseWeb::sendFooter();
}

void handleFsDownloadGet() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        g_server.send(404, "text/plain", "File system unavailable");
        return;
    }
    char path[96];
    if (!fsReadPathArg("path", path, sizeof(path))) {
        g_server.send(400, "text/plain", "Invalid path");
        return;
    }
    if (Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr)) {
        g_server.send(400, "text/plain", "Directory download is not supported");
        return;
    }
    const int64_t fileSize = Esp32BaseFs::fileSize(path);
    if (fileSize < 0) {
        g_server.send(404, "text/plain", "File not found");
        return;
    }
    if (static_cast<uint64_t>(fileSize) > static_cast<uint64_t>(UINT32_MAX)) {
        g_server.send(413, "text/plain", "File too large");
        return;
    }
    const uint32_t size = static_cast<uint32_t>(fileSize);

    if (!fsFileFullyReadable(path, size)) {
        ESP32BASE_LOG_W("web", "fs_download_read_failed path=%s stage=preflight", path);
        g_server.send(500, "text/plain", "File read failed");
        return;
    }

    char filename[64];
    fsDownloadFilename(path, filename, sizeof(filename));
    sendResponseHeader("Cache-Control", "no-store");
    if (!beginResponse(200, "application/octet-stream", filename)) {
        g_server.send(500, "text/plain", "Download failed");
        return;
    }

    uint8_t buffer[512];
    size_t sent = 0;
    while (sent < size && !g_responseBroken) {
        const size_t maxLen = size - sent > sizeof(buffer) ? sizeof(buffer) : size - sent;
        size_t readLen = 0;
        if (!Esp32BaseFs::readBytesAt(path, static_cast<uint32_t>(sent), buffer, maxLen, &readLen) || readLen == 0) {
            ESP32BASE_LOG_W("web", "fs_download_read_failed path=%s offset=%lu", path, static_cast<unsigned long>(sent));
            break;
        }
        sendChunk(reinterpret_cast<const char*>(buffer), readLen);
        sent += readLen;
        fsScanYield();
    }
    endResponse();
    ESP32BASE_LOG_I("web", "fs_download_requested path=%s bytes=%lu", path, static_cast<unsigned long>(sent));
}

void handleFsCheckGet() {
    markRequest();
    if (!ensureAuth()) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        fsSendUploadJson(503, false, "File system unavailable", nullptr);
        return;
    }
    char dir[96];
    char name[64];
    char path[96];
    if (!fsReadArg("dir", dir, sizeof(dir)) || !fsReadArg("name", name, sizeof(name))) {
        fsSendUploadJson(400, false, "Invalid filename or target path", nullptr);
        return;
    }
    if (!fsUploadDirectoryExists(dir)) {
        fsSendUploadJson(400, false, "Target directory missing", nullptr);
        return;
    }
    if (!fsBuildUploadPath(dir, name, path, sizeof(path))) {
        fsSendUploadJson(400, false, "Invalid filename or target path", nullptr);
        return;
    }
    if (recordStoreOwnsPath(path)) {
        fsSendUploadJson(403, false, "Record store files are managed by Esp32Base", path);
        return;
    }
    if (fsUploadTargetIsDirectory(path)) {
        fsSendUploadJson(400, false, "Target is a directory", path, false, true);
        return;
    }
    const bool exists = Esp32BaseFs::fileSize(path) >= 0;
    fsSendUploadJson(200, true, nullptr, path, exists, false);
}

void handleFsUploadDone() {
    markRequest();
    if (!ensureAuth()) {
        fsResetUploadState();
        return;
    }
    const bool uploadReceived = g_fsUploadReceived;
    const bool forbidden = g_fsUploadForbidden;
    const bool startFailed = g_fsUploadStartFailed;
    const bool overwrite = g_fsUploadOverwrite;
    const bool uploadFileLogTarget = g_fsUploadFileLogTarget;
    const size_t uploadBytes = g_fsUploadBytes;
    char uploadPath[96];
    char uploadTempPath[96];
    char uploadError[96];
    strlcpy(uploadPath, g_fsUploadPath, sizeof(uploadPath));
    strlcpy(uploadTempPath, g_fsUploadTempPath, sizeof(uploadTempPath));
    strlcpy(uploadError, g_fsUploadError, sizeof(uploadError));
    fsCloseUploadFile();
    if (forbidden || !requestSameOrigin()) {
        ESP32BASE_LOG_W("web", "post_rejected context=fs_upload reason=cross_origin");
        fsResetUploadState();
        fsSendUploadJson(403, false, "forbidden", uploadPath);
        return;
    }
    if (startFailed || uploadError[0]) {
        ESP32BASE_LOG_W("web", "fs_upload_rejected path=%s error=%s", uploadPath[0] ? uploadPath : "-", uploadError[0] ? uploadError : "upload rejected");
        fsRemoveUploadTempIfPresent(uploadTempPath);
        fsRecoverModifiedUploadRuntime(uploadPath, false, uploadFileLogTarget);
        fsResetUploadState();
        fsSendUploadJson(400, false, uploadError[0] ? uploadError : "upload rejected", uploadPath);
        return;
    }
    if (!uploadReceived || !uploadPath[0]) {
        ESP32BASE_LOG_W("web", "fs_upload_rejected reason=no_upload");
        fsResetUploadState();
        fsSendUploadJson(400, false, "No upload received", nullptr);
        return;
    }
    const int64_t actualSize = uploadTempPath[0] ? Esp32BaseFs::fileSize(uploadTempPath) : -1;
    if (actualSize < 0 ||
        static_cast<uint64_t>(actualSize) != uploadBytes ||
        !fsUploadFileReadableEnd(uploadTempPath, static_cast<uint64_t>(actualSize))) {
        fsRemoveUploadTempIfPresent(uploadTempPath);
        fsRecoverModifiedUploadRuntime(uploadPath, false, uploadFileLogTarget);
        fsResetUploadState();
        fsSendUploadJson(500, false, "Upload verification failed", uploadPath);
        return;
    }
    if (!fsCommitUploadedTemp(uploadTempPath, uploadPath, overwrite)) {
        fsRemoveUploadTempIfPresent(uploadTempPath);
        fsRecoverModifiedUploadRuntime(uploadPath, false, uploadFileLogTarget);
        fsResetUploadState();
        fsSendUploadJson(500, false, "Upload commit failed", uploadPath);
        return;
    }
    const char* reloadError = nullptr;
#if ESP32BASE_ENABLE_FILELOG
    const bool reloadFileLog = uploadFileLogTarget || Esp32BaseFileLog::faulted();
#else
    const bool reloadFileLog = uploadFileLogTarget;
#endif
    if (!fsReloadUploadRuntime(uploadPath, reloadFileLog, &reloadError)) {
        fsResetUploadState();
        fsSendUploadJson(500, false, reloadError ? reloadError : "Runtime reload failed", uploadPath);
        return;
    }
    {
        ESP32BASE_LOG_W("web", "fs_upload_completed path=%s bytes=%lu overwrite=%s",
                        uploadPath,
                        static_cast<unsigned long>(uploadBytes),
                        overwrite ? "yes" : "no");
        fsResetUploadState();
        if (beginResponse(200, "application/json", nullptr)) {
            sendChunk("{\"ok\":true,\"redirect\":\"/esp32base/fs?manage=1&uploaded=1\",\"path\":\"");
            sendEscapedJsonChunk(uploadPath);
            sendChunk("\"}");
            endResponse();
        }
        return;
    }
}

void handleFsUpload() {
    if (!isAuthenticated()) {
        if (g_server.upload().status == UPLOAD_FILE_START) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("unauthorized");
        }
        return;
    }
    HTTPUpload& upload = g_server.upload();
    if (upload.status == UPLOAD_FILE_START) {
        fsResetUploadState();
        g_fsUploadReceived = true;
        g_fsUploadOverwrite = g_server.hasArg("overwrite") && g_server.arg("overwrite") == "1";
        if (!requestSameOrigin()) {
            g_fsUploadForbidden = true;
            g_fsUploadStartFailed = true;
            fsSetUploadError("forbidden");
            ESP32BASE_LOG_W("web", "post_rejected context=fs_upload reason=cross_origin");
            return;
        }
        if (!Esp32BaseFs::isReady()) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("File system unavailable");
            return;
        }
        char dir[96];
        if (!fsReadArg("dir", dir, sizeof(dir))) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Invalid filename or target path");
            return;
        }
        if (!fsUploadDirectoryExists(dir)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Target directory missing");
            return;
        }
        if (!fsBuildUploadPath(dir, upload.filename.c_str(), g_fsUploadPath, sizeof(g_fsUploadPath))) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Invalid filename or target path");
            return;
        }
        if (recordStoreOwnsPath(g_fsUploadPath)) {
            g_fsUploadForbidden = true;
            g_fsUploadStartFailed = true;
            fsSetUploadError("Record store files are managed by Esp32Base");
            return;
        }
#if ESP32BASE_ENABLE_FILELOG
        g_fsUploadFileLogTarget = fileLogOwnsPath(g_fsUploadPath);
#endif
        if (fsUploadTargetIsDirectory(g_fsUploadPath)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Target is a directory");
            return;
        }
        if (!fsBuildUploadTempPath(g_fsUploadPath, g_fsUploadTempPath, sizeof(g_fsUploadTempPath))) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Could not allocate upload temp file");
            return;
        }
#if ESP32BASE_ENABLE_FILELOG
        if (g_fsUploadFileLogTarget && Esp32BaseFileLog::isEnabled()) {
            Esp32BaseFileLog::flush();
        }
#endif
        const bool exists = Esp32BaseFs::fileSize(g_fsUploadPath) >= 0;
        if (exists && !g_fsUploadOverwrite) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("File exists");
            return;
        }
        g_fsUploadModified = true;
        if (!Esp32BaseFs::writeBytes(g_fsUploadTempPath, nullptr, 0)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Could not open upload temp file");
            return;
        }
        g_fsUploadActive = true;
    } else if (upload.status == UPLOAD_FILE_WRITE) {
        if (g_fsUploadForbidden || g_fsUploadStartFailed || !g_fsUploadActive) {
            return;
        }
        if (!Esp32BaseFs::appendBytes(g_fsUploadTempPath, upload.buf, upload.currentSize)) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("File write failed");
            fsCloseUploadFile();
            return;
        }
        g_fsUploadBytes += upload.currentSize;
        fsScanYield();
    } else if (upload.status == UPLOAD_FILE_END) {
        if (g_fsUploadForbidden || g_fsUploadStartFailed || !g_fsUploadActive) {
            return;
        }
        fsCloseUploadFile();
        if (upload.totalSize > 0 && g_fsUploadBytes != upload.totalSize) {
            g_fsUploadStartFailed = true;
            fsSetUploadError("Upload size mismatch");
            return;
        }
    } else if (upload.status == UPLOAD_FILE_ABORTED) {
        g_fsUploadStartFailed = true;
        fsSetUploadError("Upload aborted");
        fsCloseUploadFile();
    }
}

void handleFsDeletePost() {
    markRequest();
    if (!ensurePostAllowed("fs_delete")) {
        return;
    }
    if (!Esp32BaseFs::isReady()) {
        redirectSeeOther("/esp32base/fs?manage=1&error=fs_unavailable");
        return;
    }
    char path[96];
    if (!fsReadPathArg("path", path, sizeof(path))) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected reason=invalid_path");
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_invalid");
        return;
    }
    if (Esp32BaseFs::listDir(path, fsNoopListCallback, nullptr)) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=directory", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_directory");
        return;
    }
    if (Esp32BaseFs::fileSize(path) < 0) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=missing", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_missing");
        return;
    }
    if (recordStoreOwnsPath(path)) {
        ESP32BASE_LOG_W("web", "fs_delete_rejected path=%s reason=record_store_managed", path);
        redirectSeeOther("/esp32base/fs?manage=1&error=delete_managed");
        return;
    }
#if ESP32BASE_ENABLE_FILELOG
    const bool targetIsFileLog = fileLogOwnsPath(path);
    const bool retryFileLogAfterDelete = Esp32BaseFileLog::faulted();
    if (targetIsFileLog && Esp32BaseFileLog::isEnabled()) {
        ESP32BASE_LOG_W("web", "fs_delete_requested path=%s target=filelog", path);
        Esp32BaseFileLog::flush();
    }
#endif
    const Esp32BaseFs::RemoveFileResult removeResult = Esp32BaseFs::removeFileWithRecovery(path);
    bool ok = removeResult == Esp32BaseFs::REMOVE_FILE_DELETED ||
              removeResult == Esp32BaseFs::REMOVE_FILE_CLEARED;
    const bool deleteOk = ok;
    const bool fileClearedOnly = removeResult == Esp32BaseFs::REMOVE_FILE_CLEARED;
#if ESP32BASE_ENABLE_FILELOG
    if (!targetIsFileLog) {
        ESP32BASE_LOG_W("web", "fs_delete_requested path=%s result=%s", path,
                        removeResult == Esp32BaseFs::REMOVE_FILE_DELETED ? "deleted" :
                        (fileClearedOnly ? "cleared" : "failed"));
    }
    if (deleteOk && (targetIsFileLog || retryFileLogAfterDelete)) {
        const bool reloadOk = Esp32BaseFileLog::begin();
        ESP32BASE_LOG_W("web", "fs_delete_reload path=%s target=filelog result=%s", path, reloadOk ? "success" : "failed");
        if (!reloadOk) {
            ok = false;
        }
    }
#else
    ESP32BASE_LOG_W("web", "fs_delete_requested path=%s result=%s", path, ok ? "success" : "failed");
#endif
    redirectSeeOther(ok ? (fileClearedOnly ? "/esp32base/fs?manage=1&deleted=cleared" : "/esp32base/fs?manage=1&deleted=1")
                        : "/esp32base/fs?manage=1&error=delete_failed");
}

} // namespace esp32base_web

#endif
